# Даны два целых числа: A, B. Проверить истинность высказывания: «Каждое из чисел
# A и B нечетное».

A = input('Введите целое число')
B = input ('Введите целое число')
k = 0
try:
    A = int(A)
    B = int(B)
    if A % 2 ==0:
        k = A // 2
        print(k)
    else:
        print("Число A является нечётным")
    if B % 2 == 0:
        k = B // 2
        print(k)
    else:
        print("Числа A и B являются нечётными")
except:
    print("Что то пошло не так")
finally:
    print("Программа закончена")

